[
    {
        "id": 4,
        "name": "OmniFile",
        "description": {
            "en": "OmniFile is a file conversion application that allows users to easily convert files from one format to another. Whether you want to transform images or documents, OmniFile simplifies the process by providing an intuitive user interface and a powerful backend.",
            "fr": "OmniFile est une application de conversion de fichiers qui permet aux utilisateurs de convertir facilement des fichiers d'un format à un autre. Que vous souhaitiez transformer des images ou des documents, OmniFile simplifie le processus en fournissant une interface utilisateur intuitive et un backend puissant."
        },
        "img": "./omnifile.png",
        "url": "https://omni-file.vercel.app/",
        "github": "https://github.com/Zakaria-salmi/OmniFile",
        "content": {
            "en": "<div class=\"w-full mx-auto p-3\">\n    <h1 class=\"text-3xl font-bold mb-4\">OmniFile</h1>\n    <p class=\"mb-3\">\n        OmniFile is a file conversion application that allows users to easily convert files from one format to another. Whether you want to transform images or documents, OmniFile simplifies the process by providing an intuitive user interface and a powerful backend.\n    </p>\n    <h2 class=\"text-2xl font-semibold mb-2\">Features</h2>\n    <ul class=\"list-disc list-inside mb-3\">\n        <li>Image Conversion: Convert between multiple image formats, including JPEG, PNG, GIF, and more.</li>\n        <li>Document Conversion: Coming soon.</li>\n        <li>Video Conversion: Coming soon.</li>\n        <li>Audio Conversion: Coming soon.</li>\n        <li>User-friendly interface: A simple interface for uploading files, selecting formats, and retrieving converted files.</li>\n        <li>Error handling: Clear notifications in case of conversion errors.</li>\n    </ul>\n    <h2 class=\"text-2xl font-semibold mb-2\">Technologies Used</h2>\n    <ul class=\"list-disc list-inside\">\n        <li>Frontend: Vue.js with the Composition API for a responsive user experience.</li>\n        <li>Backend: Node.js with Express to handle conversion requests and files.</li>\n        <li>Libraries: Sharp for image conversion.</li>\n    </ul>\n</div>",
            "fr": "<div class=\"w-full mx-auto p-6\">\n    <h1 class=\"text-3xl font-bold mb-4\">OmniFile</h1>\n    <p class=\"mb-3\">\n        OmniFile est une application de conversion de fichiers qui permet aux utilisateurs de convertir facilement des fichiers d'un format à un autre. Que vous souhaitiez transformer des images ou des documents, OmniFile simplifie le processus en fournissant une interface utilisateur intuitive et un backend puissant.\n    </p>\n    <h2 class=\"text-2xl font-semibold mb-2\">Fonctionnalités</h2>\n    <ul class=\"list-disc list-inside mb-3\">\n        <li>Conversion d'images : Convertissez entre plusieurs formats d'image, y compris JPEG, PNG, GIF, et plus encore.</li>\n        <li>Conversion de documents : À venir.</li>\n        <li>Conversion de vidéos : À venir.</li>\n        <li>Conversion audio : À venir.</li>\n        <li>Interface utilisateur conviviale : Une interface simple pour télécharger des fichiers, choisir des formats et récupérer des fichiers convertis.</li>\n        <li>Gestion des erreurs : Notifications claires en cas d'erreurs de conversion.</li>\n    </ul>\n    <h2 class=\"text-2xl font-semibold mb-2\">Technologies utilisées</h2>\n    <ul class=\"list-disc list-inside\">\n        <li>Frontend : Vue.js avec la Composition API pour une expérience utilisateur réactive.</li>\n        <li>Backend : Node.js avec Express pour gérer les requêtes de conversion et les fichiers.</li>\n        <li>Librairies : Sharp pour la conversion d'images.</li>\n    </ul>\n</div>"
        }
    },
    {
        "id": 1,
        "name": "GameInfo",
        "description": {
            "en": "Game Info is a web application that allows users to search for video games and view detailed information about them.",
            "fr": "Game Info est une application web qui permet aux utilisateurs de rechercher des jeux vidéo et de consulter des informations détaillées à leur sujet."
        },
        "img": "./gaminfo.png",
        "url": "https://gaminfo-app.netlify.app/",
        "github": "https://github.com/Zakaria-salmi/Gaminfo",
        "content": {
            "en": "<div class=\"w-full mx-auto p-3\">\n    <h1 class=\"text-3xl font-bold mb-4\">Game Info </h1>\n    <p class=\"mb-3\">\n        Game Info Viewer is a web application that allows users to search for video games and view detailed information about them, including trailers, screenshots, developer information, genres, ratings, and where to buy them.\n    </p>\n    <h2 class=\"text-2xl font-semibold mb-2\">Features</h2>\n    <ul class=\"list-disc list-inside mb-3\">\n        <li>Search for video games by name</li>\n        <li>View detailed information about games, including release date, platforms, developer, genres, ratings, and metascore</li>\n        <li>Watch game trailers</li>\n        <li>View game screenshots in a lightbox viewer</li>\n        <li>See where to buy the game from various stores</li>\n    </ul>\n    <h2 class=\"text-2xl font-semibold mb-2\">Technologies Used</h2>\n    <ul class=\"list-disc list-inside\">\n        <li>Vue.js</li>\n        <li>Axios</li>\n        <li>Vue-Easy-Lightbox</li>\n        <li>Font Awesome</li>\n    </ul>\n</div>",
            "fr": "<div class=\"w-full mx-auto p-6\">\n    <h1 class=\"text-3xl font-bold mb-4\">Game Info</h1>\n    <p class=\"mb-3\">\n        Game Info Viewer est une application web qui permet aux utilisateurs de rechercher des jeux vidéo et de consulter des informations détaillées à leur sujet, y compris des bandes-annonces, des captures d'écran, des informations sur les développeurs, les genres, les évaluations et où les acheter.\n    </p>\n    <h2 class=\"text-2xl font-semibold mb-2\">Fonctionnalités</h2>\n    <ul class=\"list-disc list-inside mb-3\">\n        <li>Rechercher des jeux vidéo par nom</li>\n        <li>Voir des informations détaillées sur les jeux, y compris la date de sortie, les plateformes, le développeur, les genres, les évaluations et le metascore</li>\n        <li>Regarder des bandes-annonces de jeux</li>\n        <li>Voir des captures d'écran de jeux dans une visionneuse</li>\n        <li>Voir où acheter le jeu dans divers magasins</li>\n    </ul>\n    <h2 class=\"text-2xl font-semibold mb-2\">Technologies utilisées</h2>\n    <ul class=\"list-disc list-inside\">\n        <li>Vue.js</li>\n        <li>Axios</li>\n        <li>Vue-Easy-Lightbox</li>\n        <li>Font Awesome</li>\n    </ul>\n</div>"
        }
    },
    {
        "id": 2,
        "name": "Pomodoro Timer",
        "description": {
            "en": "Pomodoro application built with React and Vite to help you manage your time and improve your productivity. The app uses the Pomodoro technique, which consists of working for 25 minutes, followed by a 5-minute break.",
            "fr": "Une application Pomodoro construite avec React et Vite pour vous aider à gérer votre temps et améliorer votre productivité. L'application utilise la technique Pomodoro, qui consiste à travailler pendant 25 minutes, suivies d'une pause de 5 minutes."
        },
        "img": "./pomodoro.png",
        "url": "https://pdr-timer.netlify.app",
        "github": "https://github.com/Zakaria-salmi/Pomodoro-Timer",
        "content": {
            "en": "<div class=\"w-full mx-auto p-6\">\n    <h1 class=\"text-3xl font-bold mb-4\">Pomodoro Timer</h1>\n    <p class=\"mb-3\">\n        A Pomodoro application built with React and Vite to help you manage your time and improve your productivity. The app uses the Pomodoro technique, which consists of working for 25 minutes, followed by a 5-minute break.\n    </p>\n    <h2 class=\"text-2xl font-semibold mb-2\">Features</h2>\n    <ul class=\"list-disc list-inside mb-3\">\n        <li>Timer: Track work and break time.</li>\n        <li>Visual Progress: Progress indicator in the form of a circle.</li>\n        <li>Timer Controls: Start, pause, and reset the timer.</li>\n        <li>Session Type Selectors: Choose between work sessions and breaks.</li>\n    </ul>\n    <h2 class=\"text-2xl font-semibold mb-2\">Technologies Used</h2>\n    <ul class=\"list-disc list-inside mb-3\">\n        <li>React: JavaScript library for building user interfaces.</li>\n        <li>Vite: Fast development tool for starting React projects.</li>\n        <li>Tailwind CSS: CSS framework for modern and responsive styles.</li>\n    </ul>\n    <h2 class=\"text-2xl font-semibold mb-2\">Usage</h2>\n    <ul class=\"list-disc list-inside\">\n        <li>Select the session type (work or break).</li>\n        <li>Click the \"Start\" button to begin the timer.</li>\n        <li>Enjoy your session! An alarm will sound at the end of the session.</li>\n        <li>Take a break or start a new work session.</li>\n    </ul>\n</div>",
            "fr": "<div class=\"w-full mx-auto p-6\">\n    <h1 class=\"text-3xl font-bold mb-4\">Minuteur Pomodoro</h1>\n    <p class=\"mb-3\">\n        Une application Pomodoro construite avec React et Vite pour vous aider à gérer votre temps et améliorer votre productivité. L'application utilise la technique Pomodoro, qui consiste à travailler pendant 25 minutes, suivies d'une pause de 5 minutes.\n    </p>\n    <h2 class=\"text-2xl font-semibold mb-2\">Fonctionnalités</h2>\n    <ul class=\"list-disc list-inside mb-3\">\n        <li>Minuteur : Suivre le temps de travail et de pause.</li>\n        <li>Progression Visuelle : Indicateur de progression sous forme de cercle.</li>\n        <li>Contrôles du Minuteur : Démarrer, mettre en pause et réinitialiser le minuteur.</li>\n        <li>Sélecteurs de Type de Session : Choisissez entre les sessions de travail et de pause.</li>\n    </ul>\n    <h2 class=\"text-2xl font-semibold mb-2\">Technologies Utilisées</h2>\n    <ul class=\"list-disc list-inside mb-3\">\n        <li>React : Bibliothèque JavaScript pour construire des interfaces utilisateur.</li>\n        <li>Vite : Outil de développement rapide pour commencer des projets React.</li>\n        <li>Tailwind CSS : Cadre CSS pour des styles modernes et responsives.</li>\n    </ul>\n    <h2 class=\"text-2xl font-semibold mb-2\">Utilisation</h2>\n    <ul class=\"list-disc list-inside\">\n        <li>Sélectionnez le type de session (travail ou pause).</li>\n        <li>Cliquez sur le bouton \"Démarrer\" pour commencer le minuteur.</li>\n        <li>Profitez de votre session ! Une alarme retentira à la fin de la session.</li>\n        <li>Faites une pause ou commencez une nouvelle session de travail.</li>\n    </ul>\n</div>"
        }
    },
    {
        "id": 3,
        "name": "Portfolio",
        "description": {
            "en": "Portfolio Overview: Welcome to my portfolio! This project showcases my skills as a Full Stack Developer, highlighting various web applications I have developed. Explore my work to see how I can help bring your ideas to life!",
            "fr": "Bienvenue dans mon portfolio ! Ce projet met en avant mes compétences en tant que développeur Full Stack, en présentant diverses applications web que j'ai développées. Explorez mon travail pour découvrir comment je peux donner vie à vos idées !"
        },
        "img": "./portfolio.png",
        "url": "https://salmi-zakaria.com/",
        "github": "https://github.com/Zakaria-salmi/portfolio-2025",
        "content": {
            "en": "<div class='w-full mx-auto p-6'>\n    <h1 class='text-3xl font-bold mb-4'>Building My Portfolio: Technologies and Purpose</h1>\n    <p class='mb-3'>\n      Creating my portfolio was an exciting journey that allowed me to showcase my skills and projects as a Full Stack Developer. In this blog post, I will share the key technologies I used in the development process and explain the purpose of my portfolio.\n    </p>\n    <h2 class='text-2xl font-semibold mb-2'>Purpose of the Portfolio</h2>\n    <p class='mb-4'>\n      My portfolio serves multiple purposes:\n    </p>\n    <ul class='list-disc list-inside mb-3'>\n      <li>\n        <strong>Showcase My Work:</strong> It highlights the web applications I’ve developed, demonstrating my capabilities and creativity. Each project is carefully selected to reflect my skills and expertise.\n      </li>\n      <li>\n        <strong>Demonstrate Skills:</strong> The portfolio is not just a collection of projects; it also showcases my proficiency in various programming languages and frameworks, allowing potential employers or clients to see what I can do.\n      </li>\n      <li>\n        <strong>Personal Branding:</strong> It establishes my online presence as a developer, helping me connect with others in the industry, including potential employers and collaborators.\n      </li>\n      <li>\n        <strong>Learning Tool:</strong> By building and maintaining my portfolio, I continuously learn new technologies and improve my development skills.\n      </li>\n    </ul>\n    <h2 class='text-2xl font-semibold mb-2'>Technologies Used</h2>\n    <ul class='list-disc list-inside mb-3'>\n      <li>\n        <strong>1. Vue.js:</strong> Vue.js is a progressive JavaScript framework that I used to build the user interface of my portfolio. Its component-based architecture allows for reusability and scalability, making it easy to manage the application's complexity. With Vue.js, I was able to create a dynamic and responsive design that enhances user experience.\n      </li>\n      <li>\n        <strong>2. Vue Router:</strong> For navigating between different sections of my portfolio, I implemented Vue Router. This library allows for smooth transitions between components and makes the user experience more intuitive. By using Vue Router, users can easily explore various projects without the need for page reloads.\n      </li>\n      <li>\n        <strong>3. CSS and Tailwind CSS:</strong> To style my portfolio, I used a combination of traditional CSS and Tailwind CSS. Tailwind CSS is a utility-first CSS framework that enables rapid design and customization of UI components. Its responsive utilities help ensure my portfolio looks great on all devices.\n      </li>\n      <li>\n        <strong>4. Vuex:</strong> For managing the state of my application, I utilized Vuex. This state management pattern and library for Vue.js applications help keep track of shared state across components, making data flow predictable and easier to manage.\n      </li>\n      <li>\n        <strong>5. JavaScript:</strong> JavaScript is the backbone of my portfolio, powering interactive elements and ensuring seamless functionality. From handling user interactions to fetching project data, JavaScript plays a crucial role in the overall experience of my portfolio.\n      </li>\n      <li>\n        <strong>6. Git and GitHub:</strong> Version control is essential in software development. I used Git for version control and GitHub to host my project. This not only allows me to keep track of changes but also enables potential employers to review my code and contributions.\n      </li>\n      <li>\n        <strong>7. Netlify:</strong> To deploy my portfolio, I chose Netlify, a platform that provides continuous deployment and hosting. With its easy integration with GitHub, I can automatically deploy updates whenever I push changes to my repository.\n      </li>\n    </ul>\n    <h2 class='text-2xl font-semibold mb-2'>Conclusion</h2>\n    <p class='mb-4'>\n      Building my portfolio was a rewarding experience that helped me consolidate my knowledge and skills. By using modern technologies, I was able to create a platform that not only showcases my work but also serves as a learning tool. I hope this insight into the technologies used and the purpose of my portfolio inspires you to create your own!\n    </p>\n    <p>\n      Feel free to explore my portfolio and see the projects I’ve worked on!\n    </p>\n  </div>",
            "fr": "<div class='w-full mx-auto p-6'>\n    <h1 class='text-3xl font-bold mb-4'>Construire mon portfolio : Technologies et Objectif</h1>\n    <p class='mb-3'>\n      Créer mon portfolio a été un voyage passionnant qui m'a permis de mettre en valeur mes compétences et mes projets en tant que développeur Full Stack. Dans cet article de blog, je vais partager les technologies clés que j'ai utilisées dans le processus de développement et expliquer l'objectif de mon portfolio.\n    </p>\n    <h2 class='text-2xl font-semibold mb-2'>Objectif du Portfolio</h2>\n    <p class='mb-4'>\n      Mon portfolio sert à plusieurs fins :\n    </p>\n    <ul class='list-disc list-inside mb-3'>\n      <li>\n        <strong>Mettre en valeur mon travail :</strong> Il met en avant les applications web que j'ai développées, démontrant mes capacités et ma créativité. Chaque projet est soigneusement sélectionné pour refléter mes compétences et mon expertise.\n      </li>\n      <li>\n        <strong>Démontrer mes compétences :</strong> Le portfolio n'est pas seulement une collection de projets ; il met également en avant ma maîtrise de divers langages de programmation et frameworks, permettant aux employeurs ou clients potentiels de voir ce que je peux faire.\n      </li>\n      <li>\n        <strong>Branding personnel :</strong> Il établit ma présence en ligne en tant que développeur, m'aidant à me connecter avec d'autres dans l'industrie, y compris des employeurs et des collaborateurs potentiels.\n      </li>\n      <li>\n        <strong>Outil d'apprentissage :</strong> En construisant et en maintenant mon portfolio, j'apprends continuellement de nouvelles technologies et améliore mes compétences en développement.\n      </li>\n    </ul>\n    <h2 class='text-2xl font-semibold mb-2'>Technologies Utilisées</h2>\n    <ul class='list-disc list-inside mb-3'>\n      <li>\n        <strong>1. Vue.js :</strong> Vue.js est un framework JavaScript progressif que j'ai utilisé pour construire l'interface utilisateur de mon portfolio. Son architecture basée sur des composants permet la réutilisation et l'évolutivité, facilitant la gestion de la complexité de l'application. Avec Vue.js, j'ai pu créer un design dynamique et réactif qui améliore l'expérience utilisateur.\n      </li>\n      <li>\n        <strong>2. Vue Router :</strong> Pour naviguer entre les différentes sections de mon portfolio, j'ai implémenté Vue Router. Cette bibliothèque permet des transitions fluides entre les composants et rend l'expérience utilisateur plus intuitive. En utilisant Vue Router, les utilisateurs peuvent facilement explorer divers projets sans avoir besoin de recharger la page.\n      </li>\n      <li>\n        <strong>3. CSS et Tailwind CSS :</strong> Pour styliser mon portfolio, j'ai utilisé une combinaison de CSS traditionnel et de Tailwind CSS. Tailwind CSS est un framework CSS utilitaire qui permet une conception et une personnalisation rapides des composants UI. Ses utilitaires réactifs aident à garantir que mon portfolio a fière allure sur tous les appareils.\n      </li>\n      <li>\n        <strong>4. Vuex :</strong> Pour gérer l'état de mon application, j'ai utilisé Vuex. Ce modèle de gestion d'état et cette bibliothèque pour les applications Vue.js aident à garder une trace de l'état partagé entre les composants, rendant le flux de données prévisible et plus facile à gérer.\n      </li>\n      <li>\n        <strong>5. JavaScript :</strong> JavaScript est la colonne vertébrale de mon portfolio, alimentant les éléments interactifs et assurant un fonctionnement sans faille. De la gestion des interactions utilisateur à la récupération des données des projets, JavaScript joue un rôle crucial dans l'expérience globale de mon portfolio.\n      </li>\n      <li>\n        <strong>6. Git et GitHub :</strong> Le contrôle de version est essentiel dans le développement logiciel. J'ai utilisé Git pour le contrôle de version et GitHub pour héberger mon projet. Cela me permet non seulement de suivre les changements, mais aussi de permettre aux employeurs potentiels d'examiner mon code et mes contributions.\n      </li>\n      <li>\n        <strong>7. Netlify :</strong> Pour déployer mon portfolio, j'ai choisi Netlify, une plateforme qui offre un déploiement continu et un hébergement. Avec son intégration facile avec GitHub, je peux automatiquement déployer des mises à jour chaque fois que je pousse des changements dans mon dépôt.\n      </li>\n    </ul>\n    <h2 class='text-2xl font-semibold mb-2'>Conclusion</h2>\n    <p class='mb-4'>\n      Construire mon portfolio a été une expérience enrichissante qui m'a aidé à consolider mes connaissances et mes compétences. En utilisant des technologies modernes, j'ai pu créer une plateforme qui non seulement met en valeur mon travail, mais sert également d'outil d'apprentissage. J'espère que cet aperçu des technologies utilisées et de l'objectif de mon portfolio vous inspirera à créer le vôtre !\n    </p>\n    <p>\n      N'hésitez pas à explorer mon portfolio et à découvrir les projets sur lesquels j'ai travaillé !\n    </p>\n  </div>"
        }
    }
]
